{
  "1": {
    "markdown": "Shivansh Kalra\n+91-9717094960 | linkedin.com/in/shivansh-kalra | github.com/shivansh193\n\n## EDUCATION\n- **Shiv Nadar University**\n  *Bachelor of Technology in Computer Science*\n  Noida, India\n  Aug. 2023 – May 2027\n\n## TECHNICAL SKILLS\n- **Languages:** JavaScript/TypeScript (ES6+), Python, Node.js, SQL\n- **Frameworks & Tools:** React.js, Next.js, Express.js, NestJS, Redux, MongoDB, PostgreSQL, Firebase, Redis, Docker\n- **Cloud & DevOps:** AWS (EC2, S3, Lambda), Docker, CI/CD Pipelines, Microservices Architecture, RESTful APIs\n- **Relevant Coursework:** Data Structures & Algorithms, Object-Oriented Programming, Database Systems, Web Development\n\n## PROFESSIONAL EXPERIENCE\n- **FilFlo**\n  *Backend Developer*\n  Remote\n  Sept. 2024 – Present\n  - Architected and developed microservices-based backend system using Node.js and NestJS, successfully migrating 50% of monolithic codebase to distributed architecture, reducing deployment time by 40% and improving system maintainability.\n  - Optimized database queries and implemented Redis caching layer, achieving 37% improvement in data retrieval performance and reducing server response times from 800ms to sub-300ms for high-frequency operations.\n  - Built RESTful APIs serving 10,000+ requests daily with comprehensive error handling and logging, ensuring 99.8% uptime and seamless integration with frontend applications.\n  - Implemented Docker containerization for development and staging environments, streamlining deployment processes and ensuring consistency across development teams.\n\n- **Testline**\n  *Product Development Intern*\n  Remote\n  Dec. 2024 – Feb. 2025\n  - Developed 3 production-ready AI-powered features using OpenAI and Gemini APIs, serving 3,000+ active users with real-time data processing and natural language understanding capabilities.\n  - Engineered user authentication and authorization system with JWT tokens, reducing signup friction by 11% and improving overall user experience through streamlined onboarding flows.\n  - Wrote comprehensive unit and integration tests achieving 85% code coverage, identifying and resolving 25+ critical bugs before production deployment.\n\n- **Frontrunner**\n  *Software Development Intern*\n  Remote\n  May 2024 – Aug. 2024\n  - Rapidly prototyped and launched 2 full-stack MVP applications using React, Node.js, and MongoDB within 8-week sprints, contributing to 40% increase in monthly revenue through feature development.\n  - Collaborated with cross-functional teams of 5+ engineers and designers to build scalable web applications, participating in daily standups, code reviews, and sprint planning sessions.\n  - Implemented automated CI/CD pipelines using GitHub Actions, reducing manual deployment effort by 70% and enabling continuous integration for faster iteration cycles.\n\n- **CatalystIQ**\n  *Founder & Technical Lead*\n  Gurgaon, India\n  Jan. 2024 – April 2024\n  - Architected enterprise-grade AI platform achieving 18% conversion rate, reducing data processing latency by 30% through optimized backend services and caching strategies.\n  - Generated 1 Lakh+ revenue by delivering customized technical solutions to 10+ FMCG enterprises, demonstrating ability to align technical capabilities with business outcomes.\n  - Engineered ML-based recruitment system reducing hiring cycle time by 65%, showcasing expertise in implementing AI solutions for business process optimization.\n\n- **Petner**\n  *Founder & Full-Stack Developer*\n  Remote\n  Apr. 2023 – Dec. 2023",
    "ends_incomplete": false,
    "incomplete_text": null
  },
  "2": {
    "markdown": "- Built scalable SaaS platform from ground up using cloud-native architecture, securing 25+ B2B partnerships and onboarding 100+ users through technical excellence.\n- Implemented offline-first architecture with real-time synchronization using Firebase, ensuring high availability and resilience for mission-critical operations.\n\n## PROJECTS\n\n- **SNUXplore - Enterprise-Scale Navigation Platform** | *Next.js, Azure AI Services, MongoDB, Microservices*\n    - Scaled platform to 30,000+ concurrent users implementing distributed architecture with load balancing, caching layers, and optimized database queries for sub-100ms response times.\n    - Integrated RAG-based LLM system using enterprise AI services for intelligent query resolution, implementing efficient token management and response caching strategies.\n- **BuildFlow - SaaS Product Management Platform** | *React, TypeScript, REST APIs, CI/CD*\n    - Delivered production-ready SaaS solution serving 200+ enterprise users with 500+ active projects, implementing role-based access control and multi-tenant architecture.\n    - Established automated CI/CD pipelines ensuring zero-downtime deployments and maintaining 99.9% uptime SLA through robust error handling and monitoring.\n- **CatalystIQ Hub** | *React, TypeScript, Python (Flask), REST APIs, Figma*\n    - Engineered hiring platform from Figma designs to functional product, defining data models and API specifications to support core features aimed at improving hiring efficiency by 20%.\n    - Built reusable, type-safe UI components with TypeScript ensuring platform scalability and maintainability—demonstrated ability to translate design mockups into production-ready code rapidly.\n- **WEHIndia** | *Next.js, TypeScript, Firebase, Real-time Sync*\n    - Developed event-vendor matching platform with real-time data synchronization using Firebase, implementing complex UI components and state management for enhanced user interaction with dynamic data.\n\n## ACHIEVEMENTS & LEADERSHIP\n\n- Led technical development for applications being used by 200+ Enterprises\n- Top 3 in 5+ Hackathons, with projects ranging from AI/ML to blockchain\n- Self-taught advanced web technologies and cloud platforms through coursework, personal projects, and continuous learning",
    "ends_incomplete": false,
    "incomplete_text": null
  }
}